export default class data {
  constructor(){
    this.init()
  }
  init(){
    this.getData();
  }

  getData(){
    return [
      {
        title: 'ボルダリング',
        text: 'プロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキスト',
        imageData: 'hobby/hobby_1.png',
      },
      {
        title: 'ポイント',
        text: 'プロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキスト',
        imageData: 'hobby/hobby_2.png',
      },
      {
        title: 'ゲーム',
        text: 'プロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキストプロフィールのテキスト',
        imageData: 'hobby/hobby_3.png',
      },
    ];
  }
}